#Трикутник задаєтья координатами своїх вершин на площині: A(x1;y1), B(x2;y2), C(x3;y3). Визначити, чи є цей трикутник рівнобедреним.

#0
...
"x1, y2 - координати точки A"
"x2, y2 - координати точки B"
"x3, y3 - координати точки C"
"a - довжина сторони AB"
"b - довжина сторони BC"
"c - довжина сторони AC"
...
import math
#Введення даних
x1=int(input("Введіть значення x1: "))
y1=int(input("Введіть значення y1: "))
x2=int(input("Введіть значення x2: "))
y2=int(input("Введіть значення y2: "))
x3=int(input("Введіть значення x3: "))
y3=int(input("Введіть значення y3: "))

a=math.sqrt((x2-x1)**2+(y2-y1)**2)
b=math.sqrt((x3-x2)**2+(y3-y2)**2)
c=math.sqrt((x1-x3)**2+(y1-y3)**2)

#Порівняння
if a==b!=c or a==c!=b or b==c!=a :
    print("Трикутник рівнобедрений")
else:
    print("Трикутник не рівнобедрений")