#Дана цілочислова квадратна матриця. Визначити суму елементів в тих стовпцях, які не містять від’ємних елементів.
matrix = [
    [3, -3, 0],
    [8, 9, 17],
    [2, 6, 13]
]
print(matrix)
suma = 0
for i in range(len(matrix)):
    for j in range(len(matrix[i])):
        if j > 0:
            suma += matrix[i][j]

print("Сума елементів в тих стовпцях, які не містять від’ємних елементів: {0}".format(suma))

